class Test
  def initialize
    @questions = [
      "1. Переживаете ли вы в ожидании важной деловой встречи?",
      "2. Если вам поручат выступить с докладом на каком либо мероприятии, вызовет ли это у вас чувство дискомфорта?",
      "3. Вы откладываете поход к врачу до последнего момента?",
      "4. Если вам предстоит командировка в незнакомый город, постараетесь ли вы избежать этой командировки?",
      "5. Вы делитесь своими мыслями и чувствами с кем бы то ни было?",
      "6. Вас раздражает, когда незнакомые люди на улице обращаются к вам с вопросом?",
      "7. Вы думаете, что людям разных поколений действительно трудно понимать друг друга?",
      "8. Вам сложно будет сказать человеку, чтобы он вернул вам деньги, взятые у вас несколько месяцев назад?",
      "9. Вам подали некачественное блюдо в кафе. Промолчите ли вы?",
      "10. Вы заговорите с незнакомым человеком, оставшись с ним наедине?",
      "11. Обнаружив в кассе, магазине, библиотеке длинную очередь, вы встанете в нее?",
      "12. Вам неприятно быть судьей в чужих конфликтах?",
      "13. Вы всегда оцениваете произведения искусства на свой вкус, не прислушиваясь к чужому мнению?",
      "14. Если кто то выскажет ошибочную точку зрения на хорошо известный вам вопрос, вы предпочтете промолчать и не исправлять его?",
      "15. Просьбы помочь в учебе или работе раздражают вас?",
      "16. Вам проще изложить свое мнение на бумаге, чем рассказать о нем?"
    ]
    @points = 0
    @question = 0
  end

  def next_question

    puts @questions[@question]

    user_input = nil

      until (user_input == 1 or user_input == 2 or user_input == 3)
        puts "введите '1' или '2' или '3' и нажмите Enter"
        user_input = STDIN.gets.chomp.to_i
      end

      if (user_input == 1)
        @points += 2
      elsif (user_input == 3)
        @points += 1
      end

      @question += 1
  end

  def points
    @points
  end

  def finished?
    @question >= @questions.size
  end

end
